{
  "metadata": {
    "total_size": 1187398656
  },
  "weight_map": {
    "decoder.block.0.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.0.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.0.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.0.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.0.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.0.layer.1.EncDecAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.0.layer.1.EncDecAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.0.layer.1.EncDecAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.0.layer.1.EncDecAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.0.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.0.layer.2.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.0.layer.2.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.0.layer.2.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.1.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.1.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.1.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.1.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.1.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.1.layer.1.EncDecAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.1.layer.1.EncDecAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.1.layer.1.EncDecAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.1.layer.1.EncDecAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.1.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.1.layer.2.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.1.layer.2.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.1.layer.2.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.10.layer.0.SelfAttention.k.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.10.layer.0.SelfAttention.o.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.10.layer.0.SelfAttention.q.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.10.layer.0.SelfAttention.v.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.10.layer.0.layer_norm.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.10.layer.1.EncDecAttention.k.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.10.layer.1.EncDecAttention.o.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.10.layer.1.EncDecAttention.q.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.10.layer.1.EncDecAttention.v.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.10.layer.1.layer_norm.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.10.layer.2.DenseReluDense.wi.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.10.layer.2.DenseReluDense.wo.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.10.layer.2.layer_norm.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.11.layer.0.SelfAttention.k.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.11.layer.0.SelfAttention.o.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.11.layer.0.SelfAttention.q.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.11.layer.0.SelfAttention.v.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.11.layer.0.layer_norm.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.11.layer.1.EncDecAttention.k.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.11.layer.1.EncDecAttention.o.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.11.layer.1.EncDecAttention.q.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.11.layer.1.EncDecAttention.v.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.11.layer.1.layer_norm.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.11.layer.2.DenseReluDense.wi.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.11.layer.2.DenseReluDense.wo.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.11.layer.2.layer_norm.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.2.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.2.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.2.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.2.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.2.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.2.layer.1.EncDecAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.2.layer.1.EncDecAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.2.layer.1.EncDecAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.2.layer.1.EncDecAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.2.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.2.layer.2.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.2.layer.2.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.2.layer.2.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.3.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.3.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.3.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.3.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.3.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.3.layer.1.EncDecAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.3.layer.1.EncDecAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.3.layer.1.EncDecAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.3.layer.1.EncDecAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.3.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.3.layer.2.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.3.layer.2.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.3.layer.2.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.4.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.4.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.4.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.4.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.4.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.4.layer.1.EncDecAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.4.layer.1.EncDecAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.4.layer.1.EncDecAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.4.layer.1.EncDecAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.4.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.4.layer.2.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.4.layer.2.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.4.layer.2.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.5.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.5.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.5.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.5.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.5.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.5.layer.1.EncDecAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.5.layer.1.EncDecAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.5.layer.1.EncDecAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.5.layer.1.EncDecAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.5.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.5.layer.2.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.5.layer.2.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.5.layer.2.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.6.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.6.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.6.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.6.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.6.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.6.layer.1.EncDecAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.6.layer.1.EncDecAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.6.layer.1.EncDecAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.6.layer.1.EncDecAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.6.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.6.layer.2.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.6.layer.2.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.6.layer.2.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.7.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.7.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.7.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.7.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.7.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.7.layer.1.EncDecAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.7.layer.1.EncDecAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.7.layer.1.EncDecAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.7.layer.1.EncDecAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.7.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.7.layer.2.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.7.layer.2.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.7.layer.2.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.8.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.8.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.8.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.8.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.8.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.8.layer.1.EncDecAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.8.layer.1.EncDecAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.8.layer.1.EncDecAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.8.layer.1.EncDecAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.8.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.8.layer.2.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.8.layer.2.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.8.layer.2.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.9.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.9.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.9.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.9.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.9.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.9.layer.1.EncDecAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.9.layer.1.EncDecAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.9.layer.1.EncDecAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.9.layer.1.EncDecAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.9.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.block.9.layer.2.DenseReluDense.wi.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.9.layer.2.DenseReluDense.wo.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.block.9.layer.2.layer_norm.weight": "pytorch_model-00002-of-00002.bin",
    "decoder.embed_tokens.weight": "pytorch_model-00001-of-00002.bin",
    "decoder.final_layer_norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder.block.0.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.0.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.0.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.0.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.0.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.0.layer.1.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.0.layer.1.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.0.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.1.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.1.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.1.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.1.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.1.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.1.layer.1.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.1.layer.1.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.1.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.10.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.10.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.10.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.10.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.10.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.10.layer.1.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.10.layer.1.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.10.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.11.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.11.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.11.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.11.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.11.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.11.layer.1.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.11.layer.1.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.11.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.2.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.2.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.2.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.2.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.2.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.2.layer.1.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.2.layer.1.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.2.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.3.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.3.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.3.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.3.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.3.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.3.layer.1.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.3.layer.1.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.3.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.4.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.4.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.4.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.4.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.4.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.4.layer.1.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.4.layer.1.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.4.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.5.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.5.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.5.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.5.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.5.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.5.layer.1.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.5.layer.1.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.5.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.6.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.6.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.6.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.6.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.6.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.6.layer.1.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.6.layer.1.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.6.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.7.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.7.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.7.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.7.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.7.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.7.layer.1.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.7.layer.1.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.7.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.8.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.8.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.8.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.8.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.8.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.8.layer.1.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.8.layer.1.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.8.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.9.layer.0.SelfAttention.k.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.9.layer.0.SelfAttention.o.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.9.layer.0.SelfAttention.q.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.9.layer.0.SelfAttention.v.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.9.layer.0.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.9.layer.1.DenseReluDense.wi.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.9.layer.1.DenseReluDense.wo.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.block.9.layer.1.layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.embed_tokens.weight": "pytorch_model-00001-of-00002.bin",
    "encoder.final_layer_norm.weight": "pytorch_model-00001-of-00002.bin",
    "lm_head.weight": "pytorch_model-00002-of-00002.bin",
    "shared.weight": "pytorch_model-00001-of-00002.bin"
  }
}
